gastonfeng/bootloader_stm32/mFirmata.cpp
#include "mFirmata.h"

#if defined(RTE_APP) || defined(PLC)

#include <plc_rte.h>
#include <iec_types.h>
#include <kSerial.h>
#include <Base64.h>

#endif

#include <ctime>
#include <SerialFirmata.h>
#include "hwboard.h"

#ifdef USE_SERVO
#include <Servo.h>
#endif

#ifdef USE_FIRMATA_WIRE
#include <Wire.h>
#endif
#ifdef FIRMATA_SERIAL_FEATURE
SerialFirmata *serialFeature;
#endif

#ifdef USE_FREERTOS

#ifdef USE_FREERTOS

#include "STM32FreeRTOS.h"

#endif
#ifdef USE_FIRMATA_WIRE
#endif
bool isI2CEnabled;
int i2cReadDelayTime;
byte i2cRxData[8];
#endif
int queryIndex;
byte analogInputsToReport[(IO_XA_NRS + IO_YA_NRS) / 8 + 1];
byte reportPINs[IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS]; // 1 = report this port, 0 = silence
byte previousPINs[IO_XI_NRS + IO_YO_NRS];                       // previous 8 bits sent
bool isResetting;

#ifdef USE_SERVO
Servo servos[MAX_SERVOS];
byte servoPinMap[IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS];
byte detachedServos[MAX_SERVOS];
byte detachedServoCount = 0;
byte servoCount = 0;
#endif
/* pins configuration */
byte portConfigInputs[TOTAL_PORTS]; // each bit: 1 = pin in INPUT, 0 = anything else
#ifndef ARDUINO
// from arduino
#define INPUT 0
#define OUTPUT 1
#endif

#ifdef USE_FIRMATA_WIRE
void wireWrite(byte data)
{
    Wire.write((byte)data);
}

byte wireRead()
{
    return Wire.read();
}

void enableI2CPins()
{
    isI2CEnabled = true;

    Wire.begin();
}
void enableI2CPins(firmata::FirmataClass *fm)
{
    // is there a faster way to do this? would probaby require importing
    // Arduino.h to get SCL and SDA pins
    for (int i = 0; i < TOTAL_PINS; i++)
    {
        if (IS_PIN_I2C(i))
        {
            // mark pins as i2c so they are ignore in non i2c data requests
            setPinModeCallback(fm, i, PIN_MODE_I2C);
        }
    }

    isI2CEnabled = true;

    Wire.begin();
}

/* disable the i2c pins so they can be used for other functions */
void disableI2CPins()
{
    isI2CEnabled = false;
    // disable read continuous mode for all devices
    queryIndex = -1;
}
#endif
using namespace std;

void setPinModeCallback(firmata::FirmataClass *fm, byte pin, int mode);


int dbg_size();

void reportAnalogCallback(firmata::FirmataClass *fm, Stream *stream, byte analogPin, int value) {
#if defined(RTE_APP) || defined(PLC)
    if (analogPin < ANALOGVALUE_LENGTH) {
        if (value == 0) {
            analogInputsToReport[analogPin / 8] &= ~(1 << (analogPin % 8));
        } else {
            analogInputsToReport[analogPin / 8] |= (1 << (analogPin % 8));
            // prevent during system reset or all analog pin values will be reported
            // which may report noise for unconnected analog pins
            if (!isResetting) {
                // Send pin value immediately. This is helpful when connected via
                // ethernet, wi-fi or bluetooth so pin states can be known upon
                // reconnecting.
                fm->sendAnalog(stream, analogPin, plcVar.analogValue(analogPin));
            }
        }
    }
#endif
}

void reportDigitalCallback(firmata::FirmataClass *fm, Stream *, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    if (port < IO_XI_NRS + IO_YO_NRS) {
        reportPINs[port] = value;
        // Send port value immediately. This is helpful when connected via
        // ethernet, wi-fi or bluetooth so pin states can be known upon
        // reconnecting.
        //        if (value)
        //            board.outputPort(port, readPort(port, portConfigInputs[port]), true);
    }
    // do not disable analog reporting on these 8 pins, to allow some
    // pins used for digital, others analog.  Instead, allow both types
    // of reporting to be enabled, but check if the pin is configured
    // as analog when sampling the analog inputs.  Likewise, while
    // scanning digital pins, portConfigInputs will mask off values from any
    // pins configured as analog
#endif
}

void setPinValueCallback(firmata::FirmataClass *fm, Stream *, byte pin, int value) {
#if defined(RTE_APP) || defined(PLC)
    if (pin < IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS) { //&& fm->getPinMode(pin) == OUTPUT
        fm->setPinState(pin, value);
        board.outputPort(pin, value);
    }
#endif
}

void systemResetCallback(firmata::FirmataClass *fm, Stream *) {
#if defined(RTE_APP) || defined(PLC)
    isResetting = true;
    logger.debug("systemResetCallback");
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature->reset();
#endif
#ifdef USE_FIRMATA_WIRE
    if (isI2CEnabled)
    {
        disableI2CPins();
    }
#endif
    for (unsigned char &reportPIN : reportPINs)
        reportPIN = 0; // by default, reporting off
    // by default, do not report any analog inputs
    memset(analogInputsToReport, 0, sizeof(analogInputsToReport));

    /* send digital inputs to set the initial state on the host computer,
     * since once in the loop(), this firmware will only send on change */

    isResetting = false;
#endif
}

#ifdef USE_SERVO

void attachServo(firmata::FirmataClass *fm, Stream *fs, byte pin, int minPulse, int maxPulse)
{
    if (servoCount < MAX_SERVOS)
    {
        // reuse indexes of detached servos until all have been reallocated
        if (detachedServoCount > 0)
        {
            servoPinMap[pin] = detachedServos[detachedServoCount - 1];
            if (detachedServoCount > 0)
                detachedServoCount--;
        }
        else
        {
            servoPinMap[pin] = servoCount;
            servoCount++;
        }
        if (minPulse > 0 && maxPulse > 0)
        {
            servos[servoPinMap[pin]].attach(PIN_TO_DIGITAL(pin), minPulse, maxPulse);
        }
        else
        {
            servos[servoPinMap[pin]].attach(PIN_TO_DIGITAL(pin));
        }
    }
    else
    {
        fm->sendString(fs, "Max servos attached");
    }
}

void detachServo(byte pin)
{
    servos[servoPinMap[pin]].detach();
    // if we're detaching the last servo, decrement the count
    // otherwise store the index of the detached servo
    if (servoPinMap[pin] == servoCount && servoCount > 0)
    {
        servoCount--;
    }
    else if (servoCount > 0)
    {
        // keep track of detached servos because we want to reuse their indexes
        // before incrementing the count of attached servos
        detachedServoCount++;
        detachedServos[detachedServoCount - 1] = servoPinMap[pin];
    }

    servoPinMap[pin] = 255;
}
#endif
#ifdef ARDUINO

void setPinModeCallback(firmata::FirmataClass *fm, Stream *Fs, byte pin, int mode) {
    if (fm->getPinMode(pin) == PIN_MODE_IGNORE)
        return;
#ifdef USE_FIRMATA_WIRE
    if (fm->getPinMode(pin) == PIN_MODE_I2C && isI2CEnabled && mode != PIN_MODE_I2C)
    {
        // disable i2c so pins can be used for other functions
        // the following if statements should reconfigure the pins properly
        disableI2CPins();
    }
#endif
#ifdef USE_SERVO
    if (IS_PIN_DIGITAL(pin) && mode != PIN_MODE_SERVO && servoPinMap[pin] < MAX_SERVOS &&
        servos[servoPinMap[pin]].attached())
    {
        detachServo(pin);
    }
#endif
    if (IS_PIN_ANALOG(pin)) {
        reportAnalogCallback(fm, Fs, PIN_TO_ANALOG(pin), mode == PIN_MODE_ANALOG ? 1 : 0); // turn on/off reporting
    }
    if (IS_PIN_DIGITAL(pin)) {
        if (mode == INPUT || mode == PIN_MODE_PULLUP) {
            portConfigInputs[pin / 8] |= (1 << (pin & 7));
        } else {
            portConfigInputs[pin / 8] &= ~(1 << (pin & 7));
        }
    }
    fm->setPinState(pin, 0);
    switch (mode) {
        case PIN_MODE_ANALOG:
            if (IS_PIN_ANALOG(pin)) {
                if (IS_PIN_DIGITAL(pin)) {
                    //
                }
                fm->setPinMode(pin, PIN_MODE_ANALOG);
            }
            break;
        case INPUT:
            if (IS_PIN_DIGITAL(pin)) {
                fm->setPinMode(pin, INPUT);
            }
            break;
        case PIN_MODE_PULLUP:
            if (IS_PIN_DIGITAL(pin)) {
                fm->setPinMode(pin, PIN_MODE_PULLUP);
                fm->setPinState(pin, 1);
            }
            break;
        case OUTPUT:
            if (IS_PIN_DIGITAL(pin)) {
                if (fm->getPinMode(pin) == PIN_MODE_PWM) {
                    // Disable PWM if pin mode was previously set to PWM.
                    digitalWrite(PIN_TO_DIGITAL(pin), LOW);
                }
                fm->setPinMode(pin, OUTPUT);
            }
            break;
        case PIN_MODE_PWM:
            if (IS_PIN_PWM(pin)) {
                analogWrite(PIN_TO_PWM(pin), 0);
                fm->setPinMode(pin, PIN_MODE_PWM);
            }
            break;
#ifdef USE_SERVO

