gastonfeng/bootloader_stm32/mFirmata.cpp
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_GET_V);
            int bl;
            bl = base64_enc_len(4);
            char buf[8];
            base64_encode(buf, (char *) &tick, 4);
            fm->writeBytes(FirmataStream, (byte *) buf, bl);
            bl = base64_enc_len(len);
            char buf1[512];
            base64_encode(buf1, (char *) data, len);
            fm->writeBytes(FirmataStream, (byte *) buf1, bl);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
#endif
#ifdef ARDUINO
        case CB_SET_SERIAL_RX:
            u16 port;
            // port = *(uint16_t *) argv;
//            kSerial::get_serial(port)->set_rx();
            break;
        case CB_SET_SERIAL_TX_HIGH:
            u16 port1;
            // port1 = *(uint16_t *) argv;
//            kSerial::get_serial(port1)->set_high();
            break;
        case CB_SET_SERIAL_TX_LOW:
            u16 port2;
            // port2 = *(uint16_t *) argv;
//            kSerial::get_serial(port2)->set_low();
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_GET_TASK_NRS:
            fm->sendSysex(FirmataStream, FM_GET_TASK_NRS, 1, &(plc_var.info.plc_task_cnt));
            break;
        case FM_GET_TASK_NAME:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_NAME, (byte) strlen(tasks[argv[0]]->name),
                              (byte *) tasks[argv[0]]->name);
            }
            break;
        case FM_GET_TASK_DETAIL:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_DETAIL, 24, tasks[argv[0]]->mata());
            }
            break;
        case FM_GET_PLC_STATE:
            fm->sendSysex(FirmataStream, FM_GET_PLC_STATE, 1, (byte *) (&plc_var.info.plc_state));
            break;
        case FM_GET_PLC_INFO:
            if (plc_var.info.plc_curr_app) {
                info.build = plc_var.info.plc_curr_app->buildnumber;
                strcpy(info.name, plc_var.info.plc_curr_app->app_name);
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, sizeof(info), (byte *) &info);
            } else
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, 0, (byte *) &info);
            break;
        case CB_GET_LOG_NUMBER:
            fm->sendSysex(FirmataStream, CB_GET_LOG_NUMBER, 5, (byte *) (&plc_var.info.plc_state));
            break;
        case CB_GET_LOG:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_GET_LOG);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
#ifdef ARDUINO
        case CB_GET_BOOT_VERSION:
#ifdef BOOTINFO
            boot_t *b;
            b = (boot_t *) BOOTINFO; // platformio.ini中定义
            if (b)
                fm->sendSysex(FirmataStream, CB_GET_BOOT_VERSION, sizeof(boot_t), (byte *) b);
            else
#endif
        {
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_GET_BOOT_VERSION);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
        }
            break;
#endif
#endif
#ifdef USE_KVDB
            case CB_READ_KEY:
                size_t vlen;
                buffer = kvdb.get((const char *) argv);
                vlen = strlen(buffer);
                if (vlen > 0)
                    fm->sendSysex(FirmataStream, CB_READ_KEY, (byte) vlen, (byte *) buffer);
                else
                    fm->sendSysex(FirmataStream, CB_READ_KEY, 0, (byte *) buffer);
                break;
            case CB_WRITE_KEY:
                size_t key_len;
                key_len = strlen((const char *) argv);
                int rw;
                rw = kvdb.set((const char *) argv, (const char *) argv + key_len + 1, (int) (argc - key_len - 1));
                fm->sendSysex(FirmataStream, CB_WRITE_KEY, 4, (byte *) &rw);
                break;
            case CB_RM_KEY:
                kvdb.remove((const char *) argv);
                fm->sendSysex(FirmataStream, CB_RM_KEY, 0, argv);
                break;
            case CB_SET_TSL_RANGE:
                key_len = strlen((const char *) argv);
                tsl_query q;
                start = *(u32 *) &argv[key_len + 1];
                end = *(u32 *) &argv[key_len + 1 + 4];
                state = (int) *(u32 *) &argv[key_len + 1 + 8];
                tsdb.query((const char *) argv, start, end, (fdb_tsl_status) (state), &q);
                fm->sendSysex(FirmataStream, CB_SET_TSL_RANGE, sizeof(tsl_query), (byte *) &q);
                break;
            case CB_SET_TSL_END:
                int l2;
                l2 = tsdb.query_end((const char *) argv, argv[0], argv[1], argv[2], argv[3], argv[4], argv[5]);
                fm->sendSysex(FirmataStream, CB_SET_TSL_END, 4, (byte *) &l2);
                break;
            case CB_GET_TSL:
                char *tbuf;
                int tlen;
                tbuf = (char *) malloc(256);
                tlen = tsdb.query_read((const char *) argv, (u32 *) &tbuf[0], (fdb_time_t *) &tbuf[4], (int *) (tbuf + 8),
                                       tbuf + 12, 256 - 12);
                if (tlen < 0)
                    tlen = 0;
                fm->sendSysex(FirmataStream, CB_GET_TSL, (byte) tlen, (byte *) tbuf);
                free(tbuf);
                break;
            case CB_TSL_REMOVE:
                key_len = strlen((const char *) argv);
                index = *(int *) &argv[key_len + 1];
                tsdb.remove((const char *) (argv), index);
                fm->sendSysex(FirmataStream, CB_TSL_REMOVE, (byte) sizeof(tlen1), (byte *) &tlen1);
                break;
#endif
#ifdef USE_SOEM
            case FM_SOEM_SCAN:
                soem_scan(fm, FirmataStream);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case CB_SET_PLC_FILE:
            app.setPLCDLL((char *) argv);
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_SET_PLC_FILE);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case CB_CPU_USAGE:
            fm->sendSysex(FirmataStream, CB_CPU_USAGE, 1, (byte *) &plc_var.info.cpu_usage);
            break;
#endif
#ifdef USE_WIFI
            case CB_WIFI_LIST:
                fm->sendSysex(FirmataStream, CB_WIFI_LIST, plc_var.info.wifi_size, (byte *)&plc_var.info.wifi_list);
                break;
            case CB_WIFI_SET_PASS:
                int plen;
                plen = strlen((const char *)argv);
                kvdb.set("wifi_pass", (const char *)argv, plen);
                wifi_reload();
                fm->sendSysex(FirmataStream, CB_WIFI_SET_PASS, 0, argv);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
#ifndef PLC
        case FM_PUT_DATA_BLOCK:
            u32 crc, crc_r;
            byte *buffer_data;
            buffer_data = (byte *) malloc(argc);

            len_data = decodeByteStream(argc, argv, buffer_data);
            if (len_data > argc) {
                crc = GenerateCRC32Sum((const u8 *) buffer_data, len_data - 4, 0);
                crc_r = *(u32 *) (&buffer_data[len_data - 4]);
            }
            if (crc_r != crc) {
                state = CRC_ERROR;
            } else {
                rte.set_state(PLC_STATUS::APP_FLASH_BEGIN);
                int block = *(int *) &buffer_data[0];
                if (block == 0) {
                    // if (ifirmata.dev) {
                    //     state = DEV_IS_OPEN;
                    // } else
                    {
                        u32 object = *(u32 *) &buffer_data[4];
                        ifirmata.dev = mem_block::mems[object];
                        if (!ifirmata.dev) {
                            state = NO_DEVICE;
                        } else {
                            state = ifirmata.dev->begin(buffer_data, len);
                            if (state > 0 && state > ifirmata.parser.dataBufferSize * 7 / 8 - 4) {
                                state = (int) (ifirmata.parser.dataBufferSize * 7 / 8 - 4);
                            }
                            // logger.info("recv %s ,size= %d", &buffer_data[12], *(u32 *) &buffer_data[8]);
                        }
                    }
                } else if (block == -1) {
                    if (ifirmata.dev->Shutdown() < 0) {
                        state = DEVICE_SHUTDOWN_ERR;
                    } else {
                        state = 1;
                        rte.set_state(PLC_STATUS::APP_FLASH_END);
                        // logger.info("recv end.");
                    }
                } else {
                    if (ifirmata.dev->Write(&buffer_data[4], len_data - 8) < 0) {
                        state = DEVICE_WRITE_ERR;
                    } else {
                        state = block;
                    }
                }
            }
            fm->sendSysex(FirmataStream, FM_PUT_DATA_BLOCK, 4, (byte *) &state);
            free(buffer_data);
            break;
#endif
        case FM_GET_LOC_SIZE:
            if (plc_var.info.plc_curr_app) {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 2, (byte *) &plc_var.info.plc_curr_app->l_sz);
            } else {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            }
            break;
        case FM_GET_LOC:
            u32 l_index;
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    plc_loc_tbl_t loc = plc_var.info.plc_curr_app->l_tab[l_index];
                    len = (int) sizeof(plc_loc_dsc_t) + loc->a_size + loc->v_size;
                    buffer = (char *) malloc(len);
                    buffer[0] = loc->v_type;
                    buffer[1] = loc->v_size;
                    *(u16 *) &buffer[2] = loc->proto;
                    *(u16 *) &buffer[4] = loc->a_size;
                    memcpy(&buffer[6], loc->a_data, loc->a_size);
                    memcpy(&buffer[6 + loc->a_size], loc->v_buf, loc->v_size);
                    fm->sendSysex(FirmataStream, FM_GET_LOC, len, (byte *) buffer);
                    free(buffer);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_GET_LOC, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
        case FM_SET_LOC:
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    fm->sendSysex(FirmataStream, FM_SET_LOC, sizeof(plc_loc_tbl_t),
                                  (byte *) &plc_var.info.plc_curr_app->l_tab[l_index]);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_SET_LOC, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
#endif
#ifdef ONLINE_DEBUG
            case FM_GET_DBG_SIZE:
                if (plc_var.info.plc_curr_app) {
                    fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 4,
                                  (byte *) &plc_var.info.plc_curr_app->data->size_dbgvardsc);
                } else {
                    fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 0, nullptr);
                }
                break;
            case FM_GET_DBG:
                u32 lG_index;
                if (argc == 5) {
                    decodeByteStream(argc, argv, (byte *) &lG_index);
                    len = (int) fill_dbg((int) lG_index, decodeBuf);
                    fm->sendSysex(FirmataStream, FM_GET_DBG, len, decodeBuf);
                    break;
                }
                fm->sendSysex(FirmataStream, FM_GET_DBG, 0, nullptr);
                break;
            case FM_SET_DBG:
                if (argc == 5) {
                    decodeByteStream(argc, argv, (byte *) &lG_index);
                    if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                        break;
                    }
                }
                fm->sendSysex(FirmataStream, FM_SET_DBG, 0, nullptr);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_LOG_SET_LEVEL:
            plc_var.config.log_level = argv[0];
            fm->sendSysex(FirmataStream, FM_LOG_SET_LEVEL, 0, nullptr);
            break;
#endif
#ifdef ARDUINO_ARCH_STM32
        case FM_GET_CPU_SN:
            u32 sn[3];
            sn[0] = HAL_GetUIDw0();
            sn[1] = HAL_GetUIDw1();
            sn[2] = HAL_GetUIDw2();
            fm->sendSysex(FirmataStream, FM_GET_CPU_SN, 12, (byte *) sn);
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_READ_MEM:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            fm->sendSysex(FirmataStream, FM_READ_MEM, len, (byte *) indexv);
            break;
        case FM_WRITE_MEM:
            buffer = (char *) malloc(argc);
            decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
            indexv = *(u32 *) buffer;
            len = *(u16 *) &buffer[4];
            for (int i = 0; i < len; i++) {
                *((uint8_t *) indexv + i) = buffer[6 + i];
            }
            fm->sendSysex(FirmataStream, FM_WRITE_MEM, len, (byte *) indexv);
            free(buffer);
            break;
        case FM_READ_VALUE:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
            break;
        case FM_WRITE_VALUE:
            buffer = (char *) malloc(argc);
            decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
            indexv = *(u32 *) buffer;
            len = *(u16 *) &buffer[4];
            if (len < (argc - 6)) {
                for (int i = 0; i < len; i++) {
                    *(((uint8_t *) &plc_var) + indexv + i) = buffer[6 + i];
                }
            }
            fm->sendSysex(FirmataStream, FM_WRITE_VALUE_REP, len, (byte *) ((uint8_t *) &plc_var) + indexv);
            free(buffer);
            break;
#endif
        case FM_READ_VALUE_REP:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            memcpy(mfm->valueBuf, decodeBuf, decodedLen);
            break;
        case FM_WRITE_VALUE_REP:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);

            break;
#if defined(RTE_APP) || defined(PLC)
        case FM_READ_LOC:
            decodedLen = decodeByteStream(argc, argv, (byte *) decodeBuf);
            len = board.get_input(decodeBuf[0], decodeBuf[1], decodeBuf[2], decodeBuf[3], (char *) decodeBuf);
            fm->sendSysex(FirmataStream, FM_READ_LOC, len, (byte *) decodeBuf);
            break;
        case FM_WRITE_LOC:
            decodedLen = decodeByteStream(argc, argv, (byte *) decodeBuf);
            len = board.set_output(decodeBuf[0], decodeBuf[1], decodeBuf[2], decodeBuf[3], (char *) &decodeBuf[4],
                                   decodedLen - 4);
            fm->sendSysex(FirmataStream, FM_READ_LOC, len, (byte *) decodeBuf);
            break;
#endif
        case FM_GET_LOCATION:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = board.get_input(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, (char *) bufs);
            fm->sendSysex(FirmataStream, FM_GET_LOCATION, len, (byte *) bufs);
            break;
        case FM_SET_LOCATION:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = board.set_output(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, (char *) &decodeBuf[5],
                                   decodeBuf[4]);
            fm->sendSysex(FirmataStream, FM_SET_LOCATION, 4, (byte *) &len);
            break;
        default:
            len = -1;
            fm->sendSysex(FirmataStream, command, 4, (byte *) &len);
            break;
    }
    mfm->set_flag(command);
}

void analogWriteCallback(firmata::FirmataClass *fm, Stream *, byte i, int val) {
#if defined(RTE_APP) || defined(PLC)
    auto v = (u16) val;
    board.set_aout(i, &v);
#endif
}

void digitalWriteCallback(firmata::FirmataClass *fm, Stream *FirmataStream, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    byte lastPin, pinValue, mask = 1, pinWriteMask = 0;

    if (port < IO_XI_NRS + IO_YO_NRS) {
        // create a mask of the pins on this port that are writable.
        lastPin = port * 8 + 8;
        if (lastPin > IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS)
            lastPin = IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS;
#ifdef ARDUINO
        for (byte pin = port * 8; pin < lastPin; pin++) {
            // do not disturb non-digital pins (eg, Rx & Tx)
            if (IS_PIN_DIGITAL(pin) && (fm->getPinMode(pin) == OUTPUT || fm->getPinMode(pin) == INPUT)) {
                pinValue = ((byte) value & mask) ? 1 : 0;
                if (fm->getPinMode(pin) == OUTPUT) {
                    pinWriteMask |= mask;
                } else if (fm->getPinMode(pin) == INPUT && pinValue == 1 && fm->getPinState(pin) != 1) {
                    // only handle INPUT here for backwards compatibility
#if ARDUINO > 100
                    // pinMode(pin, INPUT_PULLUP);
#else
                    // only write to the INPUT pin to enable pullups if Arduino v1.0.0 or earlier
                    pinWriteMask |= mask;
#endif
                }
                board.setPinState(fm, FirmataStream, pin, pinValue);
            }
            mask = (byte) (mask << 1);
        }
        writePort(port, (byte) value, pinWriteMask);
#endif
    }
#endif
}

